app/views/users/index.html.erb

      <tr>
        <td><%= user.first_name || user.username %></td>
---
SELECT "users".* FROM "users"