app/controllers/users_controller.rb

  def create
    if auth_hash
      @user = User.from_omniauth(auth_hash)
    else
      @user = User.new(user_params)
    end
    respond_to do |format|
      byebug
      if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "mfree"], ["created_at", "2016-02-09 04:59:59.559242"], ["updated_at", "2016-02-09 04:59:59.559242"]]